IDENTIFICATION DIVISION.
PROGRAM-ID. ECHO.
*> Author: E2E-TEST
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-LINE     PIC X(80).
PROCEDURE DIVISION.
    ACCEPT WS-LINE
    DISPLAY "You entered: " WS-LINE
    STOP RUN.