IDENTIFICATION DIVISION.
PROGRAM-ID. GOOD.
*> Torture test: known-good program
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MSG PIC X(20) VALUE "HELLO FROM GOOD".
PROCEDURE DIVISION.
    DISPLAY WS-MSG.
    STOP RUN.